In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# pandas
* dataframe (excel -> table)
* series (excel -> column)

### making series from:
- list
- tuple 
- dict
- 1d array

In [119]:
s1 = pd.Series([10,12,13,14]) # list
s2 = pd.Series((11,12,13,14)) # tuple
s2 = pd.Series((11,12,13,14), index= ["a","b","c","d"], name = "student_num") #index replacement, naming series
s2.index.name = "ID" #renaming index
print(s1, s2, sep="\n\n")

0    10
1    12
2    13
3    14
dtype: int64

ID
a    11
b    12
c    13
d    14
Name: student_num, dtype: int64

renaming index

In [147]:
s2 = pd.Series((11,12,13,14), index= ["a","b","c","d"], name = "student_num")
s2.index = [4,3,6,5] # rename
s2 = s2.reindex([3,4,5,6,7,8]) # rearrange
s2

3    12.0
4    11.0
5    14.0
6    13.0
7     NaN
8     NaN
Name: student_num, dtype: float64

In [149]:
s2.reindex([1,2,3,4,5,6], method="bfill")

1    12.0
2    12.0
3    12.0
4    11.0
5    14.0
6    13.0
Name: student_num, dtype: float64

In [13]:
dic = {"a":1,
      "b":2,
      "c":3,
      "d":4}
s3 = pd.Series(dic) #key -> index
s3

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
#1d array to series
a = np.arange(10,20)
l = a.tolist()
s4 = pd.Series(l) #or pd.Series(list(a))
s4

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

### dataframe from:
- 2d array/ numpy structure/record
- list of list
- list of tuple
- list of dic
- dic of list
- dic of series
- dic of dic

In [46]:
#2d array to dataframe
a

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [50]:
a
df2 = pd.DataFrame(a)
df2.columns=['a', 'b', 'c']
df2

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [6]:
df1 = pd.DataFrame(np.random.randint(1,100,size=(100,5)), columns=["math", "eng", "urdu", "phy", "chem"]) #100 rows 5 col, range for values is 1-100
df1

    math  eng  urdu  phy  chem
0     29   59    79   94    47
1     42   25    55   30    24
2     39   51    60   88    90
3     92    2    23   91    21
4     69   62     5   42    95
5     65   72    33   56    82
6     35   33    24   81    60
7     83   67     2   26    28
8     80   40    36   63    52
9     50   43    64   32    64
10     3   33    51   57    34
11    37   72     8   92    28
12     6   29    55   75    29
13    48   75    24   41    95
14    78   13    60   15    79
15    55   14    70   76    69
16    11   19    74    6    50
17    20   54    58   92    22
18    12   79    97   33    14
19     2   25    15   74    12
20    13   76    69    9    32
21    57   66    78   95    94
22    94   80    27   15    56
23    19   69    99   13    17
24    48   77    78   55    89
25    57    4    11   74    93
26    51   84    22   66    17
27    45   64    89   59    84
28    69   83    22   55    24
29     8   68    75   75    21
..   ...  ...   ...  ...   ...
70    88    1    13   39    56
71    49   27    83   76    92
72    32   43     4   98    70
73    56   65    14   12    72
74    84   44    91   50    64
75     1   14    37   79    89
76     5   51    30   62    66
77    40   66    16   87     6
78    55   44    59   79    49
79    41   46    29   32    38
80    17   15    25   92    27
81     6   50    60   95    30
82     8   41     5   74    40
83    21   28    80   81    78
84    78   79     9   97    25
85    69   39    69   56    53
86    53   55    71   76    36
87    91   78    25   79    62
88    30   55    70   25     8
89    63   61     1   98    81
90    54   35    49   68     4
91    24   95    62   26    19
92    50   88    88   72    65
93    92    3    28   84    67
94    66   10    69   36    31
95    82   73    27   75     1
96     3   17    59   90    24
97    27   17     6   59    34
98    13   70    95   54    92
99    54   88    57   48    50

[100 rows x 5 columns]

In [6]:
#list of list
#id, name, course, fee
data = [[1, "aisha", "AI", 1200],
       [2, "soni", "AI", 1200],
       [3, "wardi", "CNC", 1300],
       [4, "khola", "CNC", 1300]]
data

[[1, 'aisha', 'AI', 1200],
 [2, 'soni', 'AI', 1200],
 [3, 'wardi', 'CNC', 1300],
 [4, 'khola', 'CNC', 1300]]

In [7]:
df1 = pd.DataFrame(data)
df1

   0      1    2     3
0  1  aisha   AI  1200
1  2   soni   AI  1200
2  3  wardi  CNC  1300
3  4  khola  CNC  1300

In [15]:
df1 = pd.DataFrame(data, columns=["ID","name","course","fee"]) #or index = range(1,6)
df1.index = range(1,5)
df3 = df1.copy(True)
print(id(df1) == id(df3))
df3.dtypes
df3.fee = 30
df3

False

   ID   name course  fee
1   1  aisha     AI   30
2   2   soni     AI   30
3   3  wardi    CNC   30
4   4  khola    CNC   30

In [ ]:
#list of tuple

In [ ]:
data = [(1, "aisha", "AI", 1200),
       (2, "soni", "AI", 1200),
       (3, "wardi", "CNC", 1300),
       (4, "khola", "CNC", 1300)]
data

In [63]:
df1 = pd.DataFrame(data, columns=["ID","name","course","fee"], index = range(1,5)) 
df1

   ID   name course   fee
1   1  aisha     AI  1200
2   2   soni     AI  1200
3   3  wardi    CNC  1300
4   4  khola    CNC  1300

In [ ]:
#dict of list

In [28]:
d1 = {"ID": [1,2,3,4,5],
      "name": ["aisha","soni","wardi","khola","shamo"],
      "course":["AI","AI","CNC","CNC","AIOT"],
      "fee":[1200, 1200, 1300, 1300, 1500]}
df1 = pd.DataFrame(d1)
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   soni     AI  1200
2   3  wardi    CNC  1300
3   4  khola    CNC  1300
4   5  shamo   AIOT  1500

In [ ]:
#dic of series

In [9]:
d1 = {"a":pd.Series([1,2,3]),
      "b":pd.Series([3,4,5]),
     }
pd.DataFrame(d1)

   a  b
0  1  3
1  2  4
2  3  5

In [10]:
#dic of dic

In [13]:
d1 = {"a":{0:1,1:5,2:3},
      "b":{0:1,1:2,2:3},
      "c":{0:1,1:2,2:3}
     }
pd.DataFrame(d1)

   a  b  c
0  1  1  1
1  5  2  2
2  3  3  3

In [14]:
#list of dic

In [19]:
l = [{"a":1,"b":5,"c":3},{"a":1,"b":15,"c":3},{"a":1,"b":25,"c":3}]
pd.DataFrame(l)

   a   b  c
0  1   5  3
1  1  15  3
2  1  25  3

# get general information from data frame

In [13]:
d1 = {"ID": [1,2,3,4],
      "name": ["aisha","soni","wardi","khola"],
      "course":["AI","AI","CNC","CNC"],
      "fee":[1200, 1200, 1300, 1300]}
df1 = pd.DataFrame(d1)
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   soni     AI  1200
2   3  wardi    CNC  1300
3   4  khola    CNC  1300

In [24]:
#dataframe.info()
#dataframe.describe()
#dataframe.dtypes
#dataframe.columns
#dataframe.index
#dataframe.values
#dataframe.isnull()
#dataframe.isnull().sum()
#dataframe.notnull()
#dataframe.notnull().sum
#dataframe.head(n=5)
#dataframe.tail()
#dataframe.apply() #pass user define function

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
ID        4 non-null int64
name      4 non-null object
course    4 non-null object
fee       4 non-null int64
dtypes: int64(2), object(2)
memory usage: 208.0+ bytes

In [7]:
df1.describe()

             ID          fee
count  4.000000     4.000000
mean   2.500000  1250.000000
std    1.290994    57.735027
min    1.000000  1200.000000
25%    1.750000  1200.000000
50%    2.500000  1250.000000
75%    3.250000  1300.000000
max    4.000000  1300.000000

In [27]:
df1.columns

Index(['ID', 'name', 'course', 'fee'], dtype='object')

In [28]:
df1.dtypes

ID         int64
name      object
course    object
fee        int64
dtype: object

In [29]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
df1.values

array([[1, 'aisha', 'AI', 1200],
       [2, 'soni', 'AI', 1200],
       [3, 'wardi', 'CNC', 1300],
       [4, 'khola', 'CNC', 1300]], dtype=object)

In [32]:
len(df1) #count of rows

4

In [156]:
d1 = {"ID": [1,2,3,4],
      "name": ["aisha",None,"wardi",np.nan],
      "course":["AI","AI","CNC","CNC"],
      "fee":[1200, 1200, 1300, 1300]}
df1 = pd.DataFrame(d1)
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   None     AI  1200
2   3  wardi    CNC  1300
3   4    NaN    CNC  1300

In [36]:
df1.isnull()

      ID   name  course    fee
0  False  False   False  False
1  False   True   False  False
2  False  False   False  False
3  False   True   False  False

In [38]:
df1.isnull().sum()

ID        0
name      2
course    0
fee       0
dtype: int64

In [40]:
df1.notnull().sum()

ID        4
name      2
course    4
fee       4
dtype: int64

In [37]:
df1.count()

ID        4
name      2
course    4
fee       4
dtype: int64

In [42]:
df1.head(3)

   ID   name course   fee
0   1  aisha     AI  1200
1   2   None     AI  1200
2   3  wardi    CNC  1300

In [43]:
df1.tail(2)

   ID   name course   fee
2   3  wardi    CNC  1300
3   4    NaN    CNC  1300

In [12]:
df1.sum(axis=0)

ID                         10
name      aishasoniwardikhola
course             AIAICNCCNC
fee                      5000
dtype: object

In [13]:
df1.sum(axis=0)[["ID","fee"]]

ID       10
fee    5000
dtype: object

In [14]:
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   soni     AI  1200
2   3  wardi    CNC  1300
3   4  khola    CNC  1300

In [55]:
#extract series from df
# df.columnName
# df["columName"] (if space in between col name)

In [56]:
df1.fee

0    1200
1    1200
2    1300
3    1300
Name: fee, dtype: int64

In [42]:
# add new col in df
#df["newcolname"] (always use [] to add col)

df1["updated fee"] = 1220 #or [2200,2200,3300,3300]
df1

   ID   name course   fee  updated fee
0   1  aisha     AI  1200         1220
1   2   None     AI  1200         1220
2   3  wardi    CNC  1300         1220
3   4    NaN    CNC  1300         1220

In [23]:
df1.name

1    aisha
2     soni
3    wardi
4    khola
Name: name, dtype: object

In [24]:
df1["updated fee"] #bcz of space in col name use only this method

1    1220
2    1220
3    1220
4    1220
Name: updated fee, dtype: int64

In [150]:
df1.columns

Index(['ID', 'name', 'course', 'fee', 'updated course', 'updated fee'], dtype='object')

In [164]:
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   None     AI  1200
2   3  wardi    CNC  1300
3   4    NaN    CNC  1300

In [165]:
df1.reindex([1,2,3,4]) #rearrange row indexes

    ID   name course     fee
1  2.0   None     AI  1200.0
2  3.0  wardi    CNC  1300.0
3  4.0    NaN    CNC  1300.0
4  NaN    NaN    NaN     NaN

In [159]:
df1.columns

Index(['ID', 'name', 'course', 'fee'], dtype='object')

In [162]:
df1.reindex(columns=["fee","ID","new"]) #rearrange col indexes

    fee  ID  new
0  1200   1  NaN
1  1200   2  NaN
2  1300   3  NaN
3  1300   4  NaN

# apply general function on series

In [25]:
#dataframe.column.apply()  (pass user defined func)-->use map and apply to replace values
#dataframe.column.unique()
#dataframe.column.map()    (pass dict(map finds key and replace with value))
#dataframe.column.value_counts()
#dataframe.column.sum() #min,max,mean,std

In [14]:
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   soni     AI  1200
2   3  wardi    CNC  1300
3   4  khola    CNC  1300

In [15]:
dic = {}
for i, v in enumerate(df1.course.unique()):
    dic[v] = i
dic

{'AI': 0, 'CNC': 1}

In [16]:
df1["updated course"] = df1.course.map(dic)
df1

   ID   name course   fee  updated course
0   1  aisha     AI  1200               0
1   2   soni     AI  1200               0
2   3  wardi    CNC  1300               1
3   4  khola    CNC  1300               1

In [38]:
d1 = {
    "AI":"A.I",
    "CNC":"CN",
    None:0    #replace none with 0
}


df1["course"] = df1.course.map(d1)
df1

   ID   name course   fee  updated course  aaa
0   1  aisha    A.I  1200               0  A.I
1   2   None    A.I  1200               0  A.I
2   3  wardi     CN  1300               1   CN
3   4    NaN     CN  1300               1   CN
4   5   None      0    12               2    0

dataframe.column.unique()

In [39]:
df1.course.unique()

array(['A.I', 'CN', 0], dtype=object)

dataframe.column.value_counts()

In [81]:
for v in df1.course.unique():
    print(v, len(df1[df1.course == v]))

AI 2
CNC 2

In [40]:
df1.course.value_counts()

CN     2
A.I    2
0      1
Name: course, dtype: int64

In [84]:
df1.fee.sum()

5000

In [87]:
df1["updated fee"].sum()

4880

In [90]:
df1.fee.max()

1300

In [91]:
df1.fee.min()

1200

In [92]:
df1.fee.std()

57.735026918962575

In [93]:
df1.fee.mean()

1250.0

In [ ]:
dataframe[dataframe.col == value] #one filter
dataframe[(dataframe.col == value) & (dataframe.col == value)]

### apply function

In [19]:
df1

   ID   name course   fee  updated course
0   1  aisha     AI  1200               0
1   2   soni     AI  1200               0
2   3  wardi    CNC  1300               1
3   4  khola    CNC  1300               1

In [21]:
def update(x):
    if x == "AI":
        return 2000
    elif x == "CNC":
        return 1800
    elif x == "AIOT":
        return 1300
    else:
        return 0

In [22]:
df1["updated fee"] = df1.course.apply(update)
df1

   ID   name course   fee  updated course  updated fee
0   1  aisha     AI  1200               0         2000
1   2   soni     AI  1200               0         2000
2   3  wardi    CNC  1300               1         1800
3   4  khola    CNC  1300               1         1800

In [20]:
df2 = pd.DataFrame(np.random.randint(1,100, size=(4,5)), columns=["c1","c2","c3","c4","c5"])
df2

   c1  c2  c3  c4  c5
0  65   8  94  12  81
1  75  20  40  47  22
2  57  31   3  99  85
3  11  10  34  51  46

In [13]:
np.random.randint(1,100, size=(6,5))

array([[32, 40, 21, 55, 52],
       [93, 36,  5, 58, 44],
       [ 8, 32, 50, 58, 18],
       [ 9, 45, 98, 40, 65],
       [37, 89, 39, 22,  3],
       [34, 81, 31, 83, 76]])

# pd.concat

In [38]:
pd.concat([df1,df2]) #axis = 0, concat columnwise (top to bottom)

C:\Users\DMEO\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,ID,c1,c2,c3,c4,c5,course,fee,name,updated course,updated fee
0,1.0,NaN,NaN,NaN,NaN,NaN,AI,1200.0,aisha,0.0,2000.0
1,2.0,NaN,NaN,NaN,NaN,NaN,AI,1200.0,soni,0.0,2000.0
2,3.0,NaN,NaN,NaN,NaN,NaN,CNC,1300.0,wardi,1.0,1800.0
3,4.0,NaN,NaN,NaN,NaN,NaN,CNC,1300.0,khola,1.0,1800.0
4,5.0,NaN,NaN,NaN,NaN,NaN,AIOT,1500.0,shamo,2.0,1300.0
0,NaN,68.0,77.0,79.0,82.0,34.0,NaN,NaN,NaN,NaN,NaN
1,NaN,45.0,83.0,19.0,49.0,44.0,NaN,NaN,NaN,NaN,NaN
2,NaN,2.0,52.0,53.0,57.0,80.0,NaN,NaN,NaN,NaN,NaN
3,NaN,17.0,51.0,18.0,66.0,95.0,NaN,NaN,NaN,NaN,NaN
4,NaN,92.0,24.0,37.0,38.0,76.0,NaN,NaN,NaN,NaN,NaN

In [25]:
df = pd.concat([df1,df2], axis = 1) #concat rowwise (left to right)
df

   ID   name course   fee  updated course  updated fee  c1  c2  c3  c4  c5
0   1  aisha     AI  1200               0         2000  65   8  94  12  81
1   2   soni     AI  1200               0         2000  75  20  40  47  22
2   3  wardi    CNC  1300               1         1800  57  31   3  99  85
3   4  khola    CNC  1300               1         1800  11  10  34  51  46

In [44]:
df["total"] = df.c1 + df.c2 + df.c3 + df.c4 + df.c5
df["percentage"] = (df.c1 + df.c2 + df.c3 + df.c4 + df.c5)/500*100
df

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8

In [45]:
def grade(p):
    if p >= 80:
        return "A"
    elif p >= 70:
        return "B"
    elif p >= 60:
        return "C"
    elif p >= 50:
        return "D"
    else:
        return "F"
df["grade"] = df.percentage.apply(grade)
df

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F

course = AI -> c1--c5.sum()
course = CNC -> c1--c5.product()
course = AIOT -> c1--c5.cumsum().sum()
else 0

In [23]:
def functions(course,c1,c2,c3,c4,c5):
    if course == "AI":
        return np.array([c1,c2,c3,c4,c5]).sum()
    elif course == "CNC":
        return np.array([c1,c2,c3,c4,c5]).prod()
    elif course == "AIOT":
        return sum(np.array([c1,c2,c3,c4,c5]).cumsum())

In [64]:
df["check validation"] = df[["course","c1","c2","c3","c4","c5"]].apply(lambda x:functions(*x), axis = 1)
df

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade,check validation
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B,350
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F,199
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C,620449830
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F,26533260
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F,476

apply(axis=1) will apply function rowwise(left to right) bcz apply function works on series by default axis = 0

# sort
- by index
- by values

In [78]:
df.sort_index(ascending=False)

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade,check validation
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F,476
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F,26533260
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C,620449830
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F,199
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B,350

In [79]:
df.sort_index(axis = 1)

,ID,c1,c2,c3,c4,c5,check validation,course,fee,grade,name,percentage,total,updated course,updated fee
0,1,24,81,77,95,73,350,AI,1200,B,aisha,70.0,350,0,2000
1,2,31,8,9,92,59,199,AI,1200,F,soni,39.8,199,0,2000
2,3,65,66,71,97,21,620449830,CNC,1300,C,wardi,64.0,320,1,1800
3,4,15,39,58,17,46,26533260,CNC,1300,F,khola,35.0,175,1,1800
4,5,31,11,9,82,86,476,AIOT,1500,F,shamo,43.8,219,2,1300

In [80]:
df.sort_index(ascending=False, axis = 1)

,updated fee,updated course,total,percentage,name,grade,fee,course,check validation,c5,c4,c3,c2,c1,ID
0,2000,0,350,70.0,aisha,B,1200,AI,350,73,95,77,81,24,1
1,2000,0,199,39.8,soni,F,1200,AI,199,59,92,9,8,31,2
2,1800,1,320,64.0,wardi,C,1300,CNC,620449830,21,97,71,66,65,3
3,1800,1,175,35.0,khola,F,1300,CNC,26533260,46,17,58,39,15,4
4,1300,2,219,43.8,shamo,F,1500,AIOT,476,86,82,9,11,31,5

sort by values:
* df.sort_values("c1")
* df.sort_values(by=["c1","c2","c3"], ascending=[True,True,False])

In [82]:
#descending order by percentage
df.sort_values("percentage",ascending=False)

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade,check validation
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B,350
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C,620449830
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F,476
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F,199
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F,26533260

In [83]:
#descending percentage + course wise
df.sort_values(by=["course", "percentage"], ascending=[True, False])

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade,check validation
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B,350
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F,199
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F,476
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C,620449830
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F,26533260

# load data

In [ ]:
df = pd.read_csv("titanic.csv")
df.info()
df.head()

In [ ]:
for v in df.Survived.unique():
    print(v, len(df[df.Survived==v]))

In [ ]:
df.Survived.unique()

In [ ]:
df.Survived.value_counts()

In [ ]:
df.groupby(["Survived", "Sex"]).agg(["count"])

# Ch 5.1

In [32]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data, index=['one', 'two', 'three', 'four', 'five', 'six'])
frame

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2

In [36]:
frame.loc["one"]

state    Ohio
year     2000
pop       1.5
Name: one, dtype: object

In [38]:
frame["debt"] = np.arange(6)
frame

        state  year  pop  debt
one      Ohio  2000  1.5     0
two      Ohio  2001  1.7     1
three    Ohio  2002  3.6     2
four   Nevada  2001  2.4     3
five   Nevada  2002  2.9     4
six    Nevada  2003  3.2     5

In [39]:
frame["east"] = frame.state == "Ohio"
frame

        state  year  pop  debt   east
one      Ohio  2000  1.5     0   True
two      Ohio  2001  1.7     1   True
three    Ohio  2002  3.6     2   True
four   Nevada  2001  2.4     3  False
five   Nevada  2002  2.9     4  False
six    Nevada  2003  3.2     5  False

In [40]:
del frame["east"]
frame

        state  year  pop  debt
one      Ohio  2000  1.5     0
two      Ohio  2001  1.7     1
three    Ohio  2002  3.6     2
four   Nevada  2001  2.4     3
five   Nevada  2002  2.9     4
six    Nevada  2003  3.2     5

In [43]:
frame.index.name = "ID"
frame

        state  year  pop  debt
ID
one      Ohio  2000  1.5     0
two      Ohio  2001  1.7     1
three    Ohio  2002  3.6     2
four   Nevada  2001  2.4     3
five   Nevada  2002  2.9     4
six    Nevada  2003  3.2     5

# pd.Index()

it can contain duplicate labels

In [ ]:
Index.append()
Index.difference()
Index.intersection()
Index.union()
Index.isin()
Index.delete() #pass index
Index.drop() #pass value, can't drop in case of l
Index.is_monotonic
Index.is_unique
Index.unique()

In [101]:
l = pd.Index([1,1,2,3])
l = l.append(pd.Index([3]))
l

Int64Index([1, 1, 2, 3, 3], dtype='int64')

In [91]:
a = pd.Index(np.arange(6))
a1 = a.append(frame.index)
a1

Index([0, 1, 2, 3, 4, 5, 'one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [67]:
a1.difference(a)

Index(['five', 'four', 'one', 'six', 'three', 'two'], dtype='object')

In [75]:
a1.intersection(a)  # -> common values

Index([0, 1, 2, 3, 4, 5], dtype='object')

In [105]:
a1.union(l) # all values droping duplicates

Index([0, 1, 2, 3, 4, 5, 'five', 'four', 'one', 'six', 'three', 'two'], dtype='object')

In [78]:
l.isin(a1)

array([ True,  True,  True,  True])

In [103]:
print(a1)
a1.delete(-2) #only inline operation

Index([0, 1, 2, 3, 4, 5, 'one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

Index([0, 1, 2, 3, 4, 5, 'one', 'two', 'three', 'four', 'six'], dtype='object')

In [166]:
a1.drop("one") # if any duplicate is in Index then can't drop e.g in case of l

Index([0, 1, 2, 3, 4, 5, 'one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [113]:
l.is_monotonic #Returns True if each element is greater than or equal to the previous element

True

In [116]:
l.is_unique

False

In [118]:
l.unique()

Int64Index([1, 2, 3], dtype='int64')

In [110]:
frame.index.

In [53]:
drop

TypeError: Index does not support mutable operations

# Dropping Entries from an Axis

inline function untill inplace = true

In [180]:
s = pd.Series([1,2,3], index=["a","b","c"])
s

a    1
b    2
c    3
dtype: int64

In [182]:
s.drop("a")

b    2
c    3
dtype: int64

In [183]:
s.drop(["b","c"])

a    1
dtype: int64

In [184]:
s

a    1
b    2
c    3
dtype: int64

In [185]:
s.drop("a", inplace=True)
s

b    2
c    3
dtype: int64

In [186]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [188]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [189]:
data.drop("one", axis=1) #or axis = "columns"

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

# Indexing, Selection, and Filtering